/*
Скобки
Проверить строку состоящую из скобок "(" и ")" на корректность.

Данные на входе: 	На вход подается строка состоящая из символов '(', ')' и заканчивающаяся символом '.'. Размер строки не более 1000 символов.
Данные на выходе: 	Необходимо напечатать слово YES если скобки расставлены верно и NO в противном случае.

Пример №1
Данные на входе: 	(()()).
Данные на выходе: 	YES

Пример №2
Данные на входе: 	()(.
Данные на выходе: 	NO
 */

#include <stdio.h>

int main() {
    char current_char;

    int bracket = 0;
    while ((current_char = getchar()) != '.') {
        if (bracket >= 0) {
            if (current_char == '(')
                bracket++;
            else if (current_char == ')')
                bracket--;
        }
    }

    if (bracket == 0)
        printf("YES");
    else
        printf("NO");

    return 0;
}
