/*
 Сумма квадратов маленьких чисел
Ввести два целых числа a и b (a ≤ b) и вывести сумму квадратов всех чисел от a до b.

Данные на входе:		Два целых числа по модулю не больше 100
Данные на выходе:	Сумма квадратов от первого введенного числа до второго

Пример №1
Данные на входе:	4 10
Данные на выходе:	371

Пример №2
Данные на входе:	1 5
Данные на выходе:	55
 */

#include <stdio.h>

int main() {
    int a = 0, b = 0;

    if (scanf("%d", &a) != 1)
        return 1;

    if (scanf("%d", &b) != 1)
        return 1;

    if (a >= 0 && b > 0 && a <= 100 && b <= 100) {
        int summ = 0;
        for (int i = a; i <= b; i++)
            summ += i * i;

        printf("%d", summ);

        return 0;
    }

    return 1;
}
